{
    "title": "How Will AI Developments Shape the Future of Work?",
    "content": "<p>The potential for automation of formerly human-exclusive tasks by AI (artificial intelligence) presents significant issues in disrupting employment, seemingly justifying concerns regarding job displacement in an AI-driven future, with an estimated 25% of labour tasks in the United States susceptible to automation by AI (Briggs, Kodnani, 2023). Indeed, this outlook is reflected in public sentiment, with 30% of respondents across roles from executives to part-time employees fearing their job being replaced by AI (Morikawa, 2017). However, sectors involving human interactions, such as creative and managerial areas, appear less susceptible to, if not augmented by, AI developments. This essay will argue that, despite the unlikeliness of human interactions ever being fully mapped to AI substitutes, the future of employment will ultimately converge into a symbiotic relationship between humans and AI technologies to ensure efficiency across industries.</p><p>Many identify repetitive processes as the first to be consumed by the AI wave, characteristic of occupations with procedures efficiently completed by computational algorithms, such as those in telemarketing and lower-level IT jobs, confirmed by a rise in unemployment from 3.6% to 5.7% in the IT sector (Lin, 2025). However, the impact on managerial positions is arguably of greater significance, as critical decision-making and strategic direction occur here, influencing millions of consumers. Implementations of human-like AI overseeing company actions have transformed corporate leadership. The world’s first humanoid robot CEO, Mika, was introduced in 2022 at Dictador, a drinks company based in Poland (Skubis, Wodarski, 2023). Mika exemplifies the capabilities of AI in these high-level positions; able to operate round-the-clock, she eliminates the need for companies to consider employees’ working hours, ensuring major incidents such as stock market fluctuations and cybersecurity threats are swiftly identified and addressed before a human would act. This would require machine learning techniques such as LSTM to predict stock prices and K-means clustering to detect cyber-attacks (Delplace, Hermoso, Anandita, 2019). These technologies would work alongside the core LLM, powering natural language processing to classify incidents into appropriate actions. That Mika possesses no inherent motives confirms her suitability as CEO, wholly acting in accordance with Dictador’s strategic goals (Newo, 2023). However, this necessitates extensive prompt engineering to ensure the model fully understands company objectives. Techniques such as chain-of-thought prompting might achieve this by breaking down characteristics of a humanoid CEO into specific steps, guiding the model logically (Cisco, 2024). This enables it to integrate knowledge of lower divisions into a broader vision to drive the company forward. Despite these opportunities, human executives still manage the most consequential decisions (Skubis, Wodarski, 2023), raising uncertainties about whether the labour cost reductions associated with AI executive roles truly yield economic benefits. Overall, AI’s ability to process vast datasets and derive insights suggests a future of AI in managerial roles, supplemented by human oversight, as essential for business competitiveness.</p><p>If one is asked to state an area of work that will remain unscathed by AI, the creative industry is often mentioned. Our ability to innovate, using increasingly nuanced methods of problem-solving and emotional expression, appears firmly grounded in human experience and intuition. Moreover, a significant component of people’s appreciation for creative work is tied to its authenticity and originality, resolutely absent from AI-generated counterparts. An interesting perspective is to explore the assistive capabilities of AI in this industry rather than outright replacement of human jobs. From tools such as OpenAI’s ChatGPT, enhancing scriptwriting for playwrights and creative directors, producing content sometimes indistinguishable from human work (Erickson, 2024), to newer tools such as AIVA, a sophisticated ‘music generation assistant,’ AI can generate preliminary drafts from artistic prompts, permitting producers to explore new creative possibilities (Aiva, 2024). It creates a medium where generative technologies and creativity coexist rather than compete. However, while some artists may embrace AI’s collaborative prospects, the risk of oversaturation persists; indeed, an overabundance of AI-generated creative goods may make it harder for human work to stand out and lead to deskilling in fields like marketing (Erickson, 2024). This may be caused by companies prioritising AI-generated content over hiring human creatives to cut costs. Nevertheless, the cultural implications and human experiences behind artistry remain beyond AI’s reach. Since the inception of image generator tools such as DALL-E, debates have persisted regarding their infringement of intellectual property, suggesting that AI produces images based on discrete datasets rather than genuine originality. This underscores the need for human creatives to remain at the centre of innovation in the creative sector, refining AI-generated ideas into meaningful artistic expressions. However, the extent to which this argument holds against rapid generative advancements remains uncertain. Google’s research project Magenta, utilising the transformer architecture to generate music closely resembling human performances, raises questions about the ‘limit’ of generated content - the point where audiences can no longer differentiate between human-curated and AI-generated works (Magenta, 2024). Some argue this is sufficient to remove human input entirely, threatening the creative industry’s existence. On balance, while human ingenuity remains irreplaceable at present, allowing AI content to succeed in conjunction with human effort, its role will be increasingly scrutinised as technology advances, meaning AI’s influence will grow in the creative labour market.</p><p>To conclude, the notion that a future with AI will completely displace human workers across all industries fails to recognise the potential for a complete change to the labour market, allowing for parallel utilisation of human ideas with that of AI, increasing efficiency in terms of time and economically, while providing alternative insight that hitherto would not have been in consideration. This will permit human capabilities to be supported in the future of work, empowered by the ever-increasing abilities of AI.</p><p>Bibliography:</p><p>Erickson, K. (2024). AI and work in the creative industries: digital continuity or discontinuity? Creative Industries Journal, pp.1–21. doi:https://doi.org/10.1080/17510694.2024.2421135.</p><p>Delplace, A., Hermoso, S. and Anandita, K. (2019). Cyber Attack Detection thanks to Machine Learning Algorithms. [online] COMS7507: Advanced Security. Available at: https://arxiv.org/abs/2001.06309 [Accessed 14 Feb. 2025].</p><p>Skubis, I. and Wodarski, K. (2023). Humanoid Robots in Managerial Positions – Decision-Making Process and Human Oversight. [online] Organisation and Management Series. Available at: https://managementpapers.polsl.pl/wp-content/uploads/2024/02/189-Skubis-Wodarski.pdf [Accessed 14 Feb. 2025].</p><p>Morikawa, M. (2017). Who Are Afraid of Losing Their Jobs to Artificial Intelligence and Robots? Evidence from a Survey. [online] GLO Discussion Paper Series. Available at: https://ideas.repec.org/p/zbw/glodps/71.html. [Accessed 14 Feb. 2025].</p><p>Briggs, J. and Kodnani, D. (2023). The Potentially Large Effects of Artificial Intelligence on Economic Growth (Briggs/Kodnani). [online] Gspublishing.com. Available at: https://www.gspublishing.com/content/research/en/reports/2023/03/27/d64e052b-0f6e-45d7-967b-d7be35fabd16.html. [Accessed 14 Feb. 2025].</p><p>Newo (2023). Mika the AI-Driven CEO: Dictador’s Revolutionary Move in the World of Digital Leadership. [online] Newo. Available at: https://newo.ai/mika-the-ai-driven-ceo-dictadors-revolutionary-move-in-the-world-of-digital-leadership/ [Accessed 14 Feb. 2025].</p><p>Lin, B. (2025). IT Unemployment Rises to 5.7% as AI Hits Tech Jobs. [online] WSJ. Available at: https://www.wsj.com/articles/it-unemployment-rises-to-5-7-as-ai-hits-tech-jobs-7726bb1b. [Accessed 14 Feb. 2025].</p><p>Cisco. (2024). Outshift | 6 advanced AI prompt engineering techniques for better outputs. [online] Available at: https://outshift.cisco.com/blog/advanced-ai-prompt-engineering-techniques [Accessed 14 Feb. 2025].</p><p>Aiva (2024). AIVA - the AI composing emotional soundtrack music. [online] www.aiva.ai. Available at: https://www.aiva.ai/. [Accessed 14 Feb. 2025].</p><p>Magenta. (2020). Magenta. [online] Available at: https://magenta.tensorflow.org/. [Accessed 14 Feb. 2025].</p>"
}
