{
  "title": "The Uses and Influences of Number Bases",
  "content": "<p>James Chen</p><br /><h3>Introduction</h3><p>Number bases are a fundamental concept and completely influence the ways humans interact. Secondary education teaches us about the most common implementations of number bases, namely the uses of binary and hexadecimal, but seems to ignore the other implications of number bases to our lives, such as the history of counting, the number systems used in different languages, and even the psychological impacts of video games on the way we count. This article will explore the vast uses and implications of number bases on our lives and the way we communicate.</p><h3>Why do we count in base 10?</h3><p>The base-10 number system is called denary, and is the base that us humans count in. It seems natural to us to use base-10, however other bases can be more efficient, such as base-8 and base-16, so how come we use denary? The most probable reason is because of our hands – the fact humans have evolved to have 10 fingers, and learn to count with their fingers from an early age. Many languages even elude to this idea, such as how moro and mbouna mean 5 and 10 in the African language <em>Ali</em>, while also translating to <em>hand</em> and <em>two hands</em> respectively (Ifrah, 2000). Also, note that the term <em>digit</em> is a synonym of <em>finger</em>.</p><h3>The history of number bases in counting</h3><p>Counting has not always been done in base-10. The Babylonians used a sexagesimal (base-60) system for several supposed reasons, one of which being that the Sumerians were formed by the merging of two groups, one with a base 5 number system and the other with a base 12 system, and 60 is the product of 5 and 12 (Gill, 2019). The main issue with Babylonian mathematics was its lack of a zero, however a system with a zero was used by the Mayans, a base-20 system, called vigesimal. Other bases used by past civilisations include base-2, used by the natives of Queensland, and base-5, used by some modern South American tribes (Lippman, no date).</p><h3>The uses of binary</h3><p><em>“There are 10 types of people in the world: those who understand binary, and those who do not.”</em> The base-2 number system is called binary, containing only two characters which are used to represent every number: 1 and 0. As you will have heard before, all computer systems run on binary numbers. No matter what they are processing, whether it be images, videos, audio, programs, or files, are converted to binary numbers before stored in the computers’ memory. The advantage of this is that it is easier to store binary data, by using an \\\"on or off\\\" system to represent each number, such as how optical discs represent the transitions between pits and lands as 1s, and flat areas as 0s, or how magnetic storage represents magnetised regions as 1s, and other regions as 0s. To store text as binary numbers, each character is assigned a certain binary value, and according to the character table (usually ASCII), each character can be encoded. However, surely images and videos cannot be stored as binary numbers? In fact, the colours of each pixel, as well as other necessary data, are assigned a certain binary number, allowing computers to generate the media from their binary representations. Another reason why computers use binary is due to their use of logic gates, which output 1s or 0s depending on their inputs. For example, the AND gate outputs 1 if and only if its two inputs are both 1.</p><p>Binary has other uses outside of computer systems. For example, Braille is a tactile writing system used by the blind and visually impaired, where characters are represented by rectangles of raised or unraised dots (Sense, 2023). Other uses of a binary system include Morse Code, semaphore communication, and DNA replication, though they use a binary system instead of binary numbers explicitly.</p><h3>The uses of hexadecimal</h3><p>The base-16 number system is referred to as hexadecimal, and works in a similar way to binary, but consisting of the extra characters: A, B, C, D, E, F to represent the denary numbers from 10 to 15. You may have heard about colour codes and how they are written in hexadecimal for the sake of compactness. A colour is represented by the magnitudes of each of the components red, green, and blue, which are each written as a hexadecimal two-digit number from 0 to FF (0 to 255 in denary). As well as representing colours, hexadecimal is used in MAC addresses, which are used to distinguish between devices connected to the internet, and assembly code - a low-level programming language (ComputerScience.GCSE.GURU).</p><h3>The influence of Minecraft on base-64 counting</h3><p>Almost everybody I know has played Minecraft at some point in their life. In the game, each slot in your inventory can store a maximum of 64 of the same item in most cases, likely because of the fact 64 is a power of 2 and is used in binary. Remarkably, this seems to have a huge influence on our counting when considering factors and multiples of 64. Those who have played Minecraft are fast at dealing with operations related to 64 as they have been conditioned to count in a base-64 system. For example, a Minecraft player who has 2 stacks and 32 dirt blocks is likely to be able to quickly perform the calculation 2 X 64 + 32 = 160. Certain items form stacks of 16 instead of stacks of 64, leading Minecraft players to also be skilled in counting in base-16, such as by saying <em>I have two stacks and 1 snowball, so I have 33 snowballs.</em> (FictionPress, 2024). Furthermore, Minecraft players commonly deal with full chests containing 27 stacks of items, and are also very familiar with numbers related to 64 X 27 = 1728. The actual practicality of these calculations is questionable. Sure, they arise often when dealing with binary, but arguably we need not train ourselves to be fast at certain calculations. However, I find that the idea of playing a video game increasing our capability for mental maths is humorous and at least adds some value to playing video games.</p><h3>Conclusion</h3><p>So, there you have it. Of course, your average computer science student will learn about the uses of binary and hexadecimal in their lifetime, but it takes linguists, historians, and even gamers to understand why number bases are so fundamental and influential to the way humans communicate, interact, and even think.</p><h3>Bibliography</h3><p>ComputerScience.GCSE.GURU (no date) Uses of Hexadecimal. Available at: https://www.computerscience.gcse.guru/theory/uses-of-hexadecimal (Accessed: 23 February 2025).</p><p>FictionPress (2024) How Minecraft Changes How We Count. Available at: https://www.fictionpress.com/s/3373781/1/How-Minecraft-Changes-How-We-Count (Accessed: 9 March 2025).</p><p>Gill, N.S. (2019) Babylonian Mathematics and the Base 60 System. Available at: https://www.thoughtco.com/why-we-still-use-babylonian-mathematics-116679 (Accessed: 23 February 2025).</p><p>Ifrah, G. (2000) The Universal History of Numbers. Available at: https://books.google.co.uk/books?id=FMTI7rwevZcC&redir_esc=y&hl=en (Accessed: 23 February 2025).</p><p>Lippman, D. (no date) The Mayan Numeral System. Available at: https://math.libretexts.org/Bookshelves/Applied_Mathematics/Book%3A_Mathematics_for_the_Liberal_Arts_(Lippman)/14%3A_Applications_of_Algebra/14.5%3A_The_Mayan_Numeral_System (Accessed: 26 February 2025).</p><p>Sense (2023) Braille. Available at: https://www.sense.org.uk/information-and-advice/ways-of-communicating/braille/ (Accessed: 22 February 2025).</p>"
}
